
const Terms = () => {
    return (
        <div>
            <header aria-label="Page Header" className="bg-gray-50">
                <div className="mx-auto max-w-screen-xl px-4 py-8 sm:py-8 sm:px-6 lg:px-8">
                    <div className="sm:flex sm:items-center sm:justify-between">
                        <div className="text-center sm:text-left">
                            <h1 className="text-2xl font-bold text-gray-900 sm:text-3xl">
                                服务条款
                            </h1>

                            <p className="mt-1.5 text-sm text-gray-500">

                            </p>
                        </div>

                        <div className="mt-4 flex flex-col gap-4 sm:mt-0 sm:flex-row sm:items-center min-w-max">

                        </div>
                    </div>
                </div>
            </header>

            <div className="mx-auto max-w-screen-xl px-4 py-8 sm:py-12 sm:px-6 lg:px-8">
                <pre style={{whiteSpace:'pre-wrap', wordWrap: 'break-word'}}>
                {`欢迎使用我们的网站服务！请在使用我们的服务之前仔细阅读并理解以下服务条款。通过使用我们的服务，即表示您同意遵守本条款的规定。

1 服务概述
我们的网站提供各种功能和服务，包括但不限于提供注册和登录功能，以及其他相关服务。这些服务可能会根据我们的业务需求进行调整和更新。

2 用户责任
2.1 注册要求
在使用我们的服务之前，您可能需要创建一个帐户。您必须提供准确、完整和最新的信息，并及时更新您的个人资料。您不得冒用他人身份注册帐户。
2.2 帐户安全
您对您的帐户和密码负有保密责任，并对您的帐户活动承担全部责任。您应采取适当的措施保护您的帐户安全，避免将您的帐户信息透露给他人。
2.3 合法使用
您承诺在使用我们的服务时遵守所有适用的法律、法规和规定。您不得利用我们的服务进行任何非法、滥用、诽谤、恶意攻击或侵犯他人权益的行为。

3 知识产权
我们的网站和服务包含受知识产权法保护的内容，包括但不限于文本、图像、标志、图标和软件。除非获得我们或相关权利人的明确授权，您不得以任何形式复制、修改、分发、传播或利用这些内容。

4 免责声明
4.1 服务提供的性质
我们的网站和服务按"原样"提供，不作任何明示或暗示的保证。我们不保证网站和服务的适用性、准确性、可靠性或完整性。您应自行承担使用我们的服务的风险。
4.2 第三方链接和内容
我们的网站可能包含指向第三方网站或服务的链接，并且可能展示第三方提供的内容。这些链接和内容仅供您参考和便利，并不构成我们对这些第三方的认可或承诺。您访问这些链接和内容是基于您自己的判断和风险。
4.3 数据丢失和安全性
尽管我们采取合理的措施保护数据的安全，但由于技术限制和互联网的不可预见性，我们无法保证数据的绝对安全。对于因数据丢失、泄露或未经授权访问所导致的任何损失或损害，我们不承担责任。

5 终止和修订
我们保留随时终止、暂停或限制您使用我们的服务的权利。我们还保留随时修订和更新本服务条款的权利。对于重大变更，我们将在网站上发布通知，并尽力通过适当的方式向您提供更改前的通知。

6 法律适用和争议解决
本服务条款受中华人民共和国法律管辖。对于因本服务条款或使用我们的服务而产生的任何争议，双方应通过友好协商解决。如协商不成，则应将争议提交至有管辖权的人民法院解决。

7 其他条款
本服务条款构成您与我们之间关于使用我们服务的完整协议，取代任何先前的口头或书面协议。未行使或执行本服务条款的任何权利或规定，并不构成对该权利或规定的放弃。如本服务条款中的任何条款被认定为无效或不可执行，则该条款应尽可能接近原始意图进行解释，而其他条款仍应具有完全效力。

感谢您仔细阅读我们的服务条款。如有任何问题或疑问，请通过以下联系方式与我们取得联系：

邮箱：cyberpoc@typesafe.cn

我们将尽力在合理时间内回复您的请求和解决您的关切。

通过使用我们的服务，您表示同意遵守以上服务条款的规定。`}
                </pre>
            </div>
        </div>
    );
};

export default Terms;